<?php
$n = rand(1, 13);
switch ($n) {
    case 1:
        echo "$n клас - вчимо літери!";
        break;
    case 2:
        echo "$n клас - вчимо таблицю множення!";
        break;
    case 3:
        echo "$n клас - вчимося розв'язувати задачі!";
        break;
    case 4:
        echo "$n клас - вчимося писати твори!";
        break;
    case 5:
        echo "$n клас - починаємо вчити історію!";
        break;
    case 6:
        echo "$n клас - починаємо вчити географію та біологію!";
        break;
    case 7:
        echo "$n клас - починаємо вчити фізику та хімію!";
        break;
    case 8:
        echo "$n клас - починаємо приймати участь в олімпіадах!";
        break;
    case 9:
        echo "$n клас - вчимо багато всього!";
        break;
    case 10:
        echo "$n клас - вчимо дуууууже багато всього!";
        break;
    case 11:
        echo "$n клас - майже все вивчили!";
        break;
    case 12:
        echo "$n клас - готуємось до іспитів!";
        break;
    default:
        echo "$n - такого класу ми не маємо!";
}
